Revit 2024 API
DuctFittingAndAccessoryPressureDropItem.EndConnectorIndex Property
 The index of the end conector of the flow path.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int EndConnectorIndex { get; }
Visual Basic
Public ReadOnly Property EndConnectorIndex As Integer
	Get
Visual C++
public:
property int EndConnectorIndex {
	int get ();
}
See Also
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace